[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:65:56
 exports.STATE_FILE_NAME = 'cursor-bridge-state.json';
 exports.TOPIC_MAP_FILE_NAME = 'cursor-bridge-topic-map.json';
 exports.HEARTBEAT_FILE_NAME = 'cursor-bridge-heartbeat.json';
-function writePollHeartbeat(opDir, nowMs = Date.now()) {
-    (0, atomicWrite_1.atomicWrite)(path.join(opDir, exports.HEARTBEAT_FILE_NAME), JSON.stringify({ lastHeartbeatMs: nowMs }));
-}
+function writePollHeartbeat(opDir, nowMs = Date.now()) {}
 function requiredEnv(name) {
     const value = process.env[name];
killedBy: writePollHeartbeat writes heartbeat json
statusReason: ENOENT: no such file or directory, open '/tmp/sfvc-tg-bridge-live-9ovrvA/.swarmforge/operator/cursor-bridge-heartbeat.json'

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:68:28
 function writePollHeartbeat(opDir, nowMs = Date.now()) {
     (0, atomicWrite_1.atomicWrite)(path.join(opDir, exports.HEARTBEAT_FILE_NAME), JSON.stringify({ lastHeartbeatMs: nowMs }));
 }
-function requiredEnv(name) {
-    const value = process.env[name];
-    if (!value) {
-        throw new Error(`${name} is not set`);
-    }
-    return value;
-}
+function requiredEnv(name) {}
 function loadJsonFile(filePath) {
     if (!fs.existsSync(filePath)) {
killedBy: requiredEnv throws when unset
statusReason: Missing expected exception.

[Killed] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:70:9
 }
 function requiredEnv(name) {
     const value = process.env[name];
-    if (!value) {
+    if (value) {
         throw new Error(`${name} is not set`);
     }
killedBy: requiredEnv throws when unset
statusReason: Missing expected exception.

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:70:17
 }
 function requiredEnv(name) {
     const value = process.env[name];
-    if (!value) {
-        throw new Error(`${name} is not set`);
-    }
+    if (!value) {}
     return value;
 }
killedBy: requiredEnv throws when unset
statusReason: Missing expected exception.

[Killed] StringLiteral
out/tools/telegramCursorBridgeLive.js:71:25
 function requiredEnv(name) {
     const value = process.env[name];
     if (!value) {
-        throw new Error(`${name} is not set`);
+        throw new Error(``);
     }
     return value;
killedBy: requiredEnv throws when unset
statusReason: The input did not match the regular expression /not set/. Input:

'Error'

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:75:33
     }
     return value;
 }
-function loadJsonFile(filePath) {
-    if (!fs.existsSync(filePath)) {
-        return undefined;
-    }
-    try {
-        return JSON.parse(fs.readFileSync(filePath, 'utf8'));
-    }
-    catch {
-        return undefined;
-    }
-}
+function loadJsonFile(filePath) {}
 function writeJsonFile(filePath, value) {
     fs.writeFileSync(filePath, `${JSON.stringify(value, null, 2)}\n`, 'utf8');
killedBy: loadJsonFile and writeJsonFile round-trip
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ undefined
- {
-   updateOffset: 42
- }

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:76:35
     return value;
 }
 function loadJsonFile(filePath) {
-    if (!fs.existsSync(filePath)) {
-        return undefined;
-    }
+    if (!fs.existsSync(filePath)) {}
     try {
         return JSON.parse(fs.readFileSync(filePath, 'utf8'));
killedBy: loadJsonFile does not read when existsSync reports the path is missing
statusReason: Expected values to be strictly equal:
+ actual - expected

+ {
+   would: 'survive'
+ }
- undefined

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:76:9
     return value;
 }
 function loadJsonFile(filePath) {
-    if (!fs.existsSync(filePath)) {
+    if (true) {
         return undefined;
     }
killedBy: loadJsonFile and writeJsonFile round-trip
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ undefined
- {
-   updateOffset: 42
- }

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:79:9
     if (!fs.existsSync(filePath)) {
         return undefined;
     }
-    try {
-        return JSON.parse(fs.readFileSync(filePath, 'utf8'));
-    }
+    try {}
     catch {
         return undefined;
killedBy: loadJsonFile and writeJsonFile round-trip
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ undefined
- {
-   updateOffset: 42
- }

[Survived] BlockStatement
out/tools/telegramCursorBridgeLive.js:82:11
     try {
         return JSON.parse(fs.readFileSync(filePath, 'utf8'));
     }
-    catch {
-        return undefined;
-    }
+    catch {}
 }
 function writeJsonFile(filePath, value) {

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:86:41
         return undefined;
     }
 }
-function writeJsonFile(filePath, value) {
-    fs.writeFileSync(filePath, `${JSON.stringify(value, null, 2)}\n`, 'utf8');
-}
+function writeJsonFile(filePath, value) {}
 function loadTopicMap(filePath) {
     const raw = loadJsonFile(filePath);
killedBy: loadJsonFile and writeJsonFile round-trip
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ undefined
- {
-   updateOffset: 42
- }

[Killed] StringLiteral
out/tools/telegramCursorBridgeLive.js:87:71
     }
 }
 function writeJsonFile(filePath, value) {
-    fs.writeFileSync(filePath, `${JSON.stringify(value, null, 2)}\n`, 'utf8');
+    fs.writeFileSync(filePath, `${JSON.stringify(value, null, 2)}\n`, "");
 }
 function loadTopicMap(filePath) {
killedBy: writeJsonFile writes with utf8 encoding
statusReason: Expected values to be strictly equal:

'' !== 'utf8'

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:89:33
 function writeJsonFile(filePath, value) {
     fs.writeFileSync(filePath, `${JSON.stringify(value, null, 2)}\n`, 'utf8');
 }
-function loadTopicMap(filePath) {
-    const raw = loadJsonFile(filePath);
-    if (!raw || typeof raw !== 'object' || Array.isArray(raw)) {
-        return {};
-    }
-    return raw;
-}
+function loadTopicMap(filePath) {}
 function sleep(ms) {
     return new Promise((resolve) => setTimeout(resolve, ms));
killedBy: loadTopicMap returns empty object for invalid files
statusReason: Expected values to be strictly deep-equal:

undefined !== {}

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:91:9
 }
 function loadTopicMap(filePath) {
     const raw = loadJsonFile(filePath);
-    if (!raw || typeof raw !== 'object' || Array.isArray(raw)) {
+    if (true) {
         return {};
     }
killedBy: ensureCursorTopic reuses mapped topic id
statusReason: Telegram API responded with status 404: Not Found

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:91:64
 }
 function loadTopicMap(filePath) {
     const raw = loadJsonFile(filePath);
-    if (!raw || typeof raw !== 'object' || Array.isArray(raw)) {
-        return {};
-    }
+    if (!raw || typeof raw !== 'object' || Array.isArray(raw)) {}
     return raw;
 }
killedBy: loadTopicMap returns empty object for invalid files
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ 'not-an-object'
- {}

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:96:20
     }
     return raw;
 }
-function sleep(ms) {
-    return new Promise((resolve) => setTimeout(resolve, ms));
-}
+function sleep(ms) {}
 function inboundEventOf(update) {
     const message = update.message;
killedBy: runCursorBridgePollOnce sleeps on poll failure without custom handler
statusReason: The expression evaluated to a falsy value:

  assert.ok(Date.now() - started >= 900)

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:97:24
     return raw;
 }
 function sleep(ms) {
-    return new Promise((resolve) => setTimeout(resolve, ms));
+    return new Promise(() => undefined);
 }
 function inboundEventOf(update) {
killedBy: runCursorBridgePollOnce sleeps on poll failure without custom handler
statusReason: Test timed out in 20000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:99:33
 function sleep(ms) {
     return new Promise((resolve) => setTimeout(resolve, ms));
 }
-function inboundEventOf(update) {
-    const message = update.message;
-    if (!message?.text || message.from?.id === undefined || message.chat?.id === undefined) {
-        return undefined;
-    }
-    return {
-        fromId: message.from.id,
-        chatId: message.chat.id,
-        topicId: message.message_thread_id,
-        text: message.text,
-    };
-}
+function inboundEventOf(update) {}
 async function postChunks(token, chatId, topicId, text, replyToMessageId, sendMessage = telegramClient_1.sendTelegramMessageWithRateLimitRetry) {
     const chunks = (0, telegramCursorBridgeCore_1.splitTelegramChunks)(text);
killedBy: inboundEventOf ignores updates without text or sender
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ undefined
- {
-   chatId: -100,
-   fromId: 9,
-   text: 'hi',

[Killed] OptionalChaining
out/tools/telegramCursorBridgeLive.js:101:27
 }
 function inboundEventOf(update) {
     const message = update.message;
-    if (!message?.text || message.from?.id === undefined || message.chat?.id === undefined) {
+    if (!message?.text || message.from.id === undefined || message.chat?.id === undefined) {
         return undefined;
     }
killedBy: inboundEventOf rejects updates missing sender or chat id
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:101:93
 }
 function inboundEventOf(update) {
     const message = update.message;
-    if (!message?.text || message.from?.id === undefined || message.chat?.id === undefined) {
-        return undefined;
-    }
+    if (!message?.text || message.from?.id === undefined || message.chat?.id === undefined) {}
     return {
         fromId: message.from.id,
killedBy: inboundEventOf ignores updates without text or sender
statusReason: Cannot read properties of undefined (reading 'from')

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:111:145
         text: message.text,
     };
 }
-async function postChunks(token, chatId, topicId, text, replyToMessageId, sendMessage = telegramClient_1.sendTelegramMessageWithRateLimitRetry) {
-    const chunks = (0, telegramCursorBridgeCore_1.splitTelegramChunks)(text);
-    for (const chunk of chunks) {
-        const result = await sendMessage(token, chatId, chunk, replyToMessageId, undefined, topicId);
-        if (!result.success) {
-            throw new Error(result.error ?? 'sendTelegramMessage failed');
-        }
-    }
-}
+async function postChunks(token, chatId, topicId, text, replyToMessageId, sendMessage = telegramClient_1.sendTelegramMessageWithRateLimitRetry) {}
 function reuseCursorTopicFromMap(state, topicId) {
     return { ...state, cursorTopicId: topicId };
killedBy: postChunks splits and sends each chunk
statusReason: The expression evaluated to a falsy value:

  assert.ok(sent.length >= 1)

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:113:33
 }
 async function postChunks(token, chatId, topicId, text, replyToMessageId, sendMessage = telegramClient_1.sendTelegramMessageWithRateLimitRetry) {
     const chunks = (0, telegramCursorBridgeCore_1.splitTelegramChunks)(text);
-    for (const chunk of chunks) {
-        const result = await sendMessage(token, chatId, chunk, replyToMessageId, undefined, topicId);
-        if (!result.success) {
-            throw new Error(result.error ?? 'sendTelegramMessage failed');
-        }
-    }
+    for (const chunk of chunks) {}
 }
 function reuseCursorTopicFromMap(state, topicId) {
killedBy: postChunks splits and sends each chunk
statusReason: The expression evaluated to a falsy value:

  assert.ok(sent.length >= 1)

[Killed] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:115:13
     const chunks = (0, telegramCursorBridgeCore_1.splitTelegramChunks)(text);
     for (const chunk of chunks) {
         const result = await sendMessage(token, chatId, chunk, replyToMessageId, undefined, topicId);
-        if (!result.success) {
+        if (result.success) {
             throw new Error(result.error ?? 'sendTelegramMessage failed');
         }
killedBy: postChunks splits and sends each chunk
statusReason: sendTelegramMessage failed

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:115:13
     const chunks = (0, telegramCursorBridgeCore_1.splitTelegramChunks)(text);
     for (const chunk of chunks) {
         const result = await sendMessage(token, chatId, chunk, replyToMessageId, undefined, topicId);
-        if (!result.success) {
+        if (true) {
             throw new Error(result.error ?? 'sendTelegramMessage failed');
         }
killedBy: postChunks splits and sends each chunk
statusReason: sendTelegramMessage failed

[Killed] LogicalOperator
out/tools/telegramCursorBridgeLive.js:116:29
     for (const chunk of chunks) {
         const result = await sendMessage(token, chatId, chunk, replyToMessageId, undefined, topicId);
         if (!result.success) {
-            throw new Error(result.error ?? 'sendTelegramMessage failed');
+            throw new Error(result.error && 'sendTelegramMessage failed');
         }
     }
killedBy: postChunks surfaces send failures
statusReason: The input did not match the regular expression /network/. Input:

'Error: sendTelegramMessage failed'

[Killed] StringLiteral
out/tools/telegramCursorBridgeLive.js:116:45
     for (const chunk of chunks) {
         const result = await sendMessage(token, chatId, chunk, replyToMessageId, undefined, topicId);
         if (!result.success) {
-            throw new Error(result.error ?? 'sendTelegramMessage failed');
+            throw new Error(result.error ?? "");
         }
     }
killedBy: postChunks uses default error message when send fails without detail
statusReason: The input did not match the regular expression /sendTelegramMessage failed/. Input:

'Error'

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:120:50
         }
     }
 }
-function reuseCursorTopicFromMap(state, topicId) {
-    return { ...state, cursorTopicId: topicId };
-}
+function reuseCursorTopicFromMap(state, topicId) {}
 async function createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic) {
     const created = await createTopic(token, chatId, telegramCursorBridgeCore_1.CURSOR_BRIDGE_TOPIC_NAME);
killedBy: ensureCursorTopic reuses mapped topic id
statusReason: Cannot read properties of undefined (reading 'cursorTopicId')

[Killed] ObjectLiteral
out/tools/telegramCursorBridgeLive.js:121:12
     }
 }
 function reuseCursorTopicFromMap(state, topicId) {
-    return { ...state, cursorTopicId: topicId };
+    return {};
 }
 async function createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic) {
killedBy: ensureCursorTopic reuses mapped topic id
statusReason: Expected values to be strictly equal:

undefined !== 99

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:123:99
 function reuseCursorTopicFromMap(state, topicId) {
     return { ...state, cursorTopicId: topicId };
 }
-async function createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic) {
-    const created = await createTopic(token, chatId, telegramCursorBridgeCore_1.CURSOR_BRIDGE_TOPIC_NAME);
-    if (!created.success || created.messageThreadId === undefined) {
-        throw new Error(created.error ?? 'createForumTopic failed');
-    }
-    const nextMap = { ...topicMap, [String(created.messageThreadId)]: 'CURSOR_REMOTE' };
-    writeJsonFile(topicMapPath, nextMap);
-    return { ...state, cursorTopicId: created.messageThreadId };
-}
+async function createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic) {}
 async function ensureCursorTopic(token, chatId, topicMapPath, state, createTopic = telegramClient_1.createForumTopicWithRateLimitRetry) {
     if (state.cursorTopicId !== undefined) {
killedBy: ensureCursorTopic creates topic when map is empty
statusReason: Cannot read properties of undefined (reading 'cursorTopicId')

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:125:9
 }
 async function createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic) {
     const created = await createTopic(token, chatId, telegramCursorBridgeCore_1.CURSOR_BRIDGE_TOPIC_NAME);
-    if (!created.success || created.messageThreadId === undefined) {
+    if (true) {
         throw new Error(created.error ?? 'createForumTopic failed');
     }
killedBy: ensureCursorTopic creates topic when map is empty
statusReason: createForumTopic failed

[Killed] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:125:9
 }
 async function createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic) {
     const created = await createTopic(token, chatId, telegramCursorBridgeCore_1.CURSOR_BRIDGE_TOPIC_NAME);
-    if (!created.success || created.messageThreadId === undefined) {
+    if (created.success || created.messageThreadId === undefined) {
         throw new Error(created.error ?? 'createForumTopic failed');
     }
killedBy: ensureCursorTopic creates topic when map is empty
statusReason: createForumTopic failed

[Killed] LogicalOperator
out/tools/telegramCursorBridgeLive.js:126:25
 async function createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic) {
     const created = await createTopic(token, chatId, telegramCursorBridgeCore_1.CURSOR_BRIDGE_TOPIC_NAME);
     if (!created.success || created.messageThreadId === undefined) {
-        throw new Error(created.error ?? 'createForumTopic failed');
+        throw new Error(created.error && 'createForumTopic failed');
     }
     const nextMap = { ...topicMap, [String(created.messageThreadId)]: 'CURSOR_REMOTE' };
killedBy: ensureCursorTopic throws when topic creation fails
statusReason: The input did not match the regular expression /api down/. Input:

'Error: createForumTopic failed'

[Killed] StringLiteral
out/tools/telegramCursorBridgeLive.js:126:42
 async function createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic) {
     const created = await createTopic(token, chatId, telegramCursorBridgeCore_1.CURSOR_BRIDGE_TOPIC_NAME);
     if (!created.success || created.messageThreadId === undefined) {
-        throw new Error(created.error ?? 'createForumTopic failed');
+        throw new Error(created.error ?? "");
     }
     const nextMap = { ...topicMap, [String(created.messageThreadId)]: 'CURSOR_REMOTE' };
killedBy: ensureCursorTopic throws when create succeeds without thread id
statusReason: The input did not match the regular expression /createForumTopic failed/. Input:

'Error'

[Killed] ObjectLiteral
out/tools/telegramCursorBridgeLive.js:128:21
     if (!created.success || created.messageThreadId === undefined) {
         throw new Error(created.error ?? 'createForumTopic failed');
     }
-    const nextMap = { ...topicMap, [String(created.messageThreadId)]: 'CURSOR_REMOTE' };
+    const nextMap = {};
     writeJsonFile(topicMapPath, nextMap);
     return { ...state, cursorTopicId: created.messageThreadId };
killedBy: ensureCursorTopic creates topic when map is empty
statusReason: Expected values to be strictly deep-equal:
+ actual - expected

+ {}
- {
-   '123': 'CURSOR_REMOTE'
- }

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:132:137
     writeJsonFile(topicMapPath, nextMap);
     return { ...state, cursorTopicId: created.messageThreadId };
 }
-async function ensureCursorTopic(token, chatId, topicMapPath, state, createTopic = telegramClient_1.createForumTopicWithRateLimitRetry) {
-    if (state.cursorTopicId !== undefined) {
-        return state;
-    }
-    const topicMap = loadTopicMap(topicMapPath);
-    const action = (0, telegramCursorBridgeCore_1.decideEnsureCursorTopicAction)(topicMap);
-    if (action.kind === 'reuse') {
-        return reuseCursorTopicFromMap(state, action.topicId);
-    }
-    return createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic);
-}
+async function ensureCursorTopic(token, chatId, topicMapPath, state, createTopic = telegramClient_1.createForumTopicWithRateLimitRetry) {}
 async function promptWithHeartbeat(opDir, promptAgent, prompt, heartbeatWriter = writePollHeartbeat, heartbeatIntervalMs = telegramCursorBridgeCore_1.AGENT_RUN_HEARTBEAT_INTERVAL_MS) {
     heartbeatWriter(opDir);
killedBy: ensureCursorTopic reuses mapped topic id
statusReason: Cannot read properties of undefined (reading 'cursorTopicId')

[Killed] EqualityOperator
out/tools/telegramCursorBridgeLive.js:133:9
     return { ...state, cursorTopicId: created.messageThreadId };
 }
 async function ensureCursorTopic(token, chatId, topicMapPath, state, createTopic = telegramClient_1.createForumTopicWithRateLimitRetry) {
-    if (state.cursorTopicId !== undefined) {
+    if (state.cursorTopicId === undefined) {
         return state;
     }
killedBy: ensureCursorTopic reuses mapped topic id
statusReason: Expected values to be strictly equal:

undefined !== 99

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:133:9
     return { ...state, cursorTopicId: created.messageThreadId };
 }
 async function ensureCursorTopic(token, chatId, topicMapPath, state, createTopic = telegramClient_1.createForumTopicWithRateLimitRetry) {
-    if (state.cursorTopicId !== undefined) {
+    if (false) {
         return state;
     }
killedBy: ensureCursorTopic returns state unchanged when topic id already set
statusReason: createForumTopic must not run

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:138:34
     }
     const topicMap = loadTopicMap(topicMapPath);
     const action = (0, telegramCursorBridgeCore_1.decideEnsureCursorTopicAction)(topicMap);
-    if (action.kind === 'reuse') {
-        return reuseCursorTopicFromMap(state, action.topicId);
-    }
+    if (action.kind === 'reuse') {}
     return createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic);
 }
killedBy: ensureCursorTopic reuses mapped topic id
statusReason: Telegram API responded with status 404: Not Found

[Killed] EqualityOperator
out/tools/telegramCursorBridgeLive.js:138:9
     }
     const topicMap = loadTopicMap(topicMapPath);
     const action = (0, telegramCursorBridgeCore_1.decideEnsureCursorTopicAction)(topicMap);
-    if (action.kind === 'reuse') {
+    if (action.kind !== 'reuse') {
         return reuseCursorTopicFromMap(state, action.topicId);
     }
killedBy: ensureCursorTopic reuses mapped topic id
statusReason: Telegram API responded with status 404: Not Found

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:143:184
     }
     return createCursorRemoteTopic(token, chatId, topicMapPath, topicMap, state, createTopic);
 }
-async function promptWithHeartbeat(opDir, promptAgent, prompt, heartbeatWriter = writePollHeartbeat, heartbeatIntervalMs = telegramCursorBridgeCore_1.AGENT_RUN_HEARTBEAT_INTERVAL_MS) {
-    heartbeatWriter(opDir);
-    const timer = setInterval(() => heartbeatWriter(opDir), heartbeatIntervalMs);
-    try {
-        const result = await promptAgent(prompt);
-        return result.replyText;
-    }
-    finally {
-        clearInterval(timer);
-        heartbeatWriter(opDir);
-    }
-}
+async function promptWithHeartbeat(opDir, promptAgent, prompt, heartbeatWriter = writePollHeartbeat, heartbeatIntervalMs = telegramCursorBridgeCore_1.AGENT_RUN_HEARTBEAT_INTERVAL_MS) {}
 async function runPromptWithActiveRunRecovery(ctx, prompt, resetAgent) {
     try {
killedBy: promptWithHeartbeat writes heartbeat before and after
statusReason: Expected values to be strictly equal:

undefined !== 'ok'

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:145:31
 }
 async function promptWithHeartbeat(opDir, promptAgent, prompt, heartbeatWriter = writePollHeartbeat, heartbeatIntervalMs = telegramCursorBridgeCore_1.AGENT_RUN_HEARTBEAT_INTERVAL_MS) {
     heartbeatWriter(opDir);
-    const timer = setInterval(() => heartbeatWriter(opDir), heartbeatIntervalMs);
+    const timer = setInterval(() => undefined, heartbeatIntervalMs);
     try {
         const result = await promptAgent(prompt);
killedBy: promptWithHeartbeat writes periodic heartbeats during long prompts
statusReason: expected multiple heartbeats, got 2

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:146:9
 async function promptWithHeartbeat(opDir, promptAgent, prompt, heartbeatWriter = writePollHeartbeat, heartbeatIntervalMs = telegramCursorBridgeCore_1.AGENT_RUN_HEARTBEAT_INTERVAL_MS) {
     heartbeatWriter(opDir);
     const timer = setInterval(() => heartbeatWriter(opDir), heartbeatIntervalMs);
-    try {
-        const result = await promptAgent(prompt);
-        return result.replyText;
-    }
+    try {}
     finally {
         clearInterval(timer);
killedBy: promptWithHeartbeat writes heartbeat before and after
statusReason: Expected values to be strictly equal:

undefined !== 'ok'

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:150:13
         const result = await promptAgent(prompt);
         return result.replyText;
     }
-    finally {
-        clearInterval(timer);
-        heartbeatWriter(opDir);
-    }
+    finally {}
 }
 async function runPromptWithActiveRunRecovery(ctx, prompt, resetAgent) {
killedBy: promptWithHeartbeat writes heartbeat before and after
statusReason: The expression evaluated to a falsy value:

  assert.ok(beats.length >= 2)

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:155:72
         heartbeatWriter(opDir);
     }
 }
-async function runPromptWithActiveRunRecovery(ctx, prompt, resetAgent) {
-    try {
-        const reply = await promptWithHeartbeat(ctx.opDir, (text) => ctx.agentSession.promptAgent(text), prompt);
-        ctx.syncAgentIdFromSession();
-        return reply;
-    }
-    catch (err) {
-        const detail = err instanceof sdk_1.CursorAgentError ? err.message : err instanceof Error ? err.message : String(err);
-        if (!(0, telegramCursorBridgeCore_1.isActiveRunConflict)(detail)) {
-            throw err;
-        }
-        await resetAgent();
-        const reply = await promptWithHeartbeat(ctx.opDir, (text) => ctx.agentSession.promptAgent(text), prompt);
-        ctx.syncAgentIdFromSession();
-        return reply;
-    }
-}
+async function runPromptWithActiveRunRecovery(ctx, prompt, resetAgent) {}
 async function postInboundReply(ctx, topicId, text, replyToMessageId) {
     await ctx.post(ctx.botToken, ctx.chatId, topicId, text, replyToMessageId);
killedBy: runPromptWithActiveRunRecovery retries after active-run conflict
statusReason: The "string" argument must be of type string. Received type undefined (undefined)

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:156:9
     }
 }
 async function runPromptWithActiveRunRecovery(ctx, prompt, resetAgent) {
-    try {
-        const reply = await promptWithHeartbeat(ctx.opDir, (text) => ctx.agentSession.promptAgent(text), prompt);
-        ctx.syncAgentIdFromSession();
-        return reply;
-    }
+    try {}
     catch (err) {
         const detail = err instanceof sdk_1.CursorAgentError ? err.message : err instanceof Error ? err.message : String(err);
killedBy: runPromptWithActiveRunRecovery retries after active-run conflict
statusReason: The "string" argument must be of type string. Received type undefined (undefined)

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:157:60
 }
 async function runPromptWithActiveRunRecovery(ctx, prompt, resetAgent) {
     try {
-        const reply = await promptWithHeartbeat(ctx.opDir, (text) => ctx.agentSession.promptAgent(text), prompt);
+        const reply = await promptWithHeartbeat(ctx.opDir, () => undefined, prompt);
         ctx.syncAgentIdFromSession();
         return reply;
killedBy: runPromptWithActiveRunRecovery retries after active-run conflict
statusReason: Cannot read properties of undefined (reading 'replyText')

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:161:17
         ctx.syncAgentIdFromSession();
         return reply;
     }
-    catch (err) {
-        const detail = err instanceof sdk_1.CursorAgentError ? err.message : err instanceof Error ? err.message : String(err);
-        if (!(0, telegramCursorBridgeCore_1.isActiveRunConflict)(detail)) {
-            throw err;
-        }
-        await resetAgent();
-        const reply = await promptWithHeartbeat(ctx.opDir, (text) => ctx.agentSession.promptAgent(text), prompt);
-        ctx.syncAgentIdFromSession();
-        return reply;
-    }
+    catch (err) {}
 }
 async function postInboundReply(ctx, topicId, text, replyToMessageId) {
killedBy: runPromptWithActiveRunRecovery retries after active-run conflict
statusReason: The "string" argument must be of type string. Received type undefined (undefined)

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:163:13
     }
     catch (err) {
         const detail = err instanceof sdk_1.CursorAgentError ? err.message : err instanceof Error ? err.message : String(err);
-        if (!(0, telegramCursorBridgeCore_1.isActiveRunConflict)(detail)) {
+        if (true) {
             throw err;
         }
killedBy: runPromptWithActiveRunRecovery retries after active-run conflict
statusReason: Agent agent-xyz already has active run
