[Killed] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:163:13
     }
     catch (err) {
         const detail = err instanceof sdk_1.CursorAgentError ? err.message : err instanceof Error ? err.message : String(err);
-        if (!(0, telegramCursorBridgeCore_1.isActiveRunConflict)(detail)) {
+        if ((0, telegramCursorBridgeCore_1.isActiveRunConflict)(detail)) {
             throw err;
         }
killedBy: runPromptWithActiveRunRecovery retries after active-run conflict
statusReason: Agent agent-xyz already has active run

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:167:60
             throw err;
         }
         await resetAgent();
-        const reply = await promptWithHeartbeat(ctx.opDir, (text) => ctx.agentSession.promptAgent(text), prompt);
+        const reply = await promptWithHeartbeat(ctx.opDir, () => undefined, prompt);
         ctx.syncAgentIdFromSession();
         return reply;
killedBy: runPromptWithActiveRunRecovery retries after active-run conflict
statusReason: Cannot read properties of undefined (reading 'replyText')

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:172:71
         return reply;
     }
 }
-async function postInboundReply(ctx, topicId, text, replyToMessageId) {
-    await ctx.post(ctx.botToken, ctx.chatId, topicId, text, replyToMessageId);
-}
+async function postInboundReply(ctx, topicId, text, replyToMessageId) {}
 async function handleSimpleInboundAction(ctx, topicId, text, replyToMessageId) {
     await postInboundReply(ctx, topicId, text, replyToMessageId);
killedBy: handleInboundDecision routes help and status without agent calls
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('help') || p.includes('/help')))

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:175:80
 async function postInboundReply(ctx, topicId, text, replyToMessageId) {
     await ctx.post(ctx.botToken, ctx.chatId, topicId, text, replyToMessageId);
 }
-async function handleSimpleInboundAction(ctx, topicId, text, replyToMessageId) {
-    await postInboundReply(ctx, topicId, text, replyToMessageId);
-    return ctx.busy;
-}
+async function handleSimpleInboundAction(ctx, topicId, text, replyToMessageId) {}
 async function handlePromptInboundAction(ctx, topicId, prompt, replyToMessageId, resetAgent) {
     await postInboundReply(ctx, topicId, '⏳ Working…', replyToMessageId);
killedBy: handleInboundDecision routes help and status without agent calls
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('help') || p.includes('/help')))

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:179:94
     await postInboundReply(ctx, topicId, text, replyToMessageId);
     return ctx.busy;
 }
-async function handlePromptInboundAction(ctx, topicId, prompt, replyToMessageId, resetAgent) {
-    await postInboundReply(ctx, topicId, '⏳ Working…', replyToMessageId);
-    try {
-        const reply = await runPromptWithActiveRunRecovery(ctx, prompt, resetAgent);
-        await postInboundReply(ctx, topicId, reply, replyToMessageId);
-    }
-    catch (err) {
-        const detail = err instanceof sdk_1.CursorAgentError ? err.message : err instanceof Error ? err.message : String(err);
-        await postInboundReply(ctx, topicId, `Error: ${detail}`, replyToMessageId);
-    }
-    return false;
-}
+async function handlePromptInboundAction(ctx, topicId, prompt, replyToMessageId, resetAgent) {}
 const INBOUND_ACTION_HANDLERS = {
     refuse: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Unauthorized.', replyTo),
killedBy: runCursorBridgePollOnce processes authorized prompt updates
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:181:9
 }
 async function handlePromptInboundAction(ctx, topicId, prompt, replyToMessageId, resetAgent) {
     await postInboundReply(ctx, topicId, '⏳ Working…', replyToMessageId);
-    try {
-        const reply = await runPromptWithActiveRunRecovery(ctx, prompt, resetAgent);
-        await postInboundReply(ctx, topicId, reply, replyToMessageId);
-    }
+    try {}
     catch (err) {
         const detail = err instanceof sdk_1.CursorAgentError ? err.message : err instanceof Error ? err.message : String(err);
killedBy: handleInboundDecision surfaces agent errors to Telegram
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('model exploded')))

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:185:17
         const reply = await runPromptWithActiveRunRecovery(ctx, prompt, resetAgent);
         await postInboundReply(ctx, topicId, reply, replyToMessageId);
     }
-    catch (err) {
-        const detail = err instanceof sdk_1.CursorAgentError ? err.message : err instanceof Error ? err.message : String(err);
-        await postInboundReply(ctx, topicId, `Error: ${detail}`, replyToMessageId);
-    }
+    catch (err) {}
     return false;
 }
killedBy: handleInboundDecision surfaces agent errors to Telegram
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('model exploded')))

[Killed] ObjectLiteral
out/tools/telegramCursorBridgeLive.js:191:33
     }
     return false;
 }
-const INBOUND_ACTION_HANDLERS = {
-    refuse: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Unauthorized.', replyTo),
-    help: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatHelpMessage)(), replyTo),
-    status: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatStatusMessage)(ctx.state, ctx.busy), replyTo),
-    busy: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Busy — wait for the current run to finish.', replyTo),
-    'new-session': async (ctx, topicId, replyTo, resetAgent) => {
-        await resetAgent();
-        return handleSimpleInboundAction(ctx, topicId, 'Started a fresh Cursor session. Send your next instruction.', replyTo);
-    },
-};
+const INBOUND_ACTION_HANDLERS = {};
 async function handleInboundDecision(decision, ctx, replyToMessageId, resetAgent) {
     const topicId = ctx.state.cursorTopicId;
killedBy: handleInboundDecision routes help and status without agent calls
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('help') || p.includes('/help')))

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:192:13
     return false;
 }
 const INBOUND_ACTION_HANDLERS = {
-    refuse: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Unauthorized.', replyTo),
+    refuse: () => undefined,
     help: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatHelpMessage)(), replyTo),
     status: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatStatusMessage)(ctx.state, ctx.busy), replyTo),
killedBy: handleInboundDecision refuses unauthorized callers
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('Unauthorized')))

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:193:11
 }
 const INBOUND_ACTION_HANDLERS = {
     refuse: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Unauthorized.', replyTo),
-    help: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatHelpMessage)(), replyTo),
+    help: () => undefined,
     status: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatStatusMessage)(ctx.state, ctx.busy), replyTo),
     busy: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Busy — wait for the current run to finish.', replyTo),
killedBy: handleInboundDecision routes help and status without agent calls
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('help') || p.includes('/help')))

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:194:13
 const INBOUND_ACTION_HANDLERS = {
     refuse: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Unauthorized.', replyTo),
     help: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatHelpMessage)(), replyTo),
-    status: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatStatusMessage)(ctx.state, ctx.busy), replyTo),
+    status: () => undefined,
     busy: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Busy — wait for the current run to finish.', replyTo),
     'new-session': async (ctx, topicId, replyTo, resetAgent) => {
killedBy: handleInboundDecision routes help and status without agent calls
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('Cursor bridge status')))

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:195:11
     refuse: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Unauthorized.', replyTo),
     help: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatHelpMessage)(), replyTo),
     status: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatStatusMessage)(ctx.state, ctx.busy), replyTo),
-    busy: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Busy — wait for the current run to finish.', replyTo),
+    busy: () => undefined,
     'new-session': async (ctx, topicId, replyTo, resetAgent) => {
         await resetAgent();
killedBy: handleInboundDecision posts busy message and preserves busy flag
statusReason: The expression evaluated to a falsy value:

  assert.ok(ctx.posts.some((text) => text.includes('Busy')))

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:196:65
     help: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatHelpMessage)(), replyTo),
     status: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, (0, telegramCursorBridgeCore_1.formatStatusMessage)(ctx.state, ctx.busy), replyTo),
     busy: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Busy — wait for the current run to finish.', replyTo),
-    'new-session': async (ctx, topicId, replyTo, resetAgent) => {
-        await resetAgent();
-        return handleSimpleInboundAction(ctx, topicId, 'Started a fresh Cursor session. Send your next instruction.', replyTo);
-    },
+    'new-session': async (ctx, topicId, replyTo, resetAgent) => {},
 };
 async function handleInboundDecision(decision, ctx, replyToMessageId, resetAgent) {
killedBy: handleInboundDecision new-session resets agent and posts confirmation
statusReason: Expected values to be strictly equal:

0 !== 1

[Killed] StringLiteral
out/tools/telegramCursorBridgeLive.js:198:56
     busy: (ctx, topicId, replyTo) => handleSimpleInboundAction(ctx, topicId, 'Busy — wait for the current run to finish.', replyTo),
     'new-session': async (ctx, topicId, replyTo, resetAgent) => {
         await resetAgent();
-        return handleSimpleInboundAction(ctx, topicId, 'Started a fresh Cursor session. Send your next instruction.', replyTo);
+        return handleSimpleInboundAction(ctx, topicId, "", replyTo);
     },
 };
killedBy: handleInboundDecision new-session resets agent and posts confirmation
statusReason: The expression evaluated to a falsy value:

  assert.ok(ctx.posts.some((text) => text.includes('fresh Cursor session')))

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:201:83
         return handleSimpleInboundAction(ctx, topicId, 'Started a fresh Cursor session. Send your next instruction.', replyTo);
     },
 };
-async function handleInboundDecision(decision, ctx, replyToMessageId, resetAgent) {
-    const topicId = ctx.state.cursorTopicId;
-    if (topicId === undefined || decision.action === 'ignore') {
-        return ctx.busy;
-    }
-    const handler = INBOUND_ACTION_HANDLERS[decision.action];
-    if (handler) {
-        return handler(ctx, topicId, replyToMessageId, resetAgent);
-    }
-    if (decision.action === 'prompt') {
-        return handlePromptInboundAction(ctx, topicId, decision.text, replyToMessageId, resetAgent);
-    }
-    return ctx.busy;
-}
+async function handleInboundDecision(decision, ctx, replyToMessageId, resetAgent) {}
 async function handleFailedPoll(deps, pollFailures) {
     const nextFailures = pollFailures + 1;
killedBy: handleInboundDecision routes help and status without agent calls
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('help') || p.includes('/help')))

[Killed] LogicalOperator
out/tools/telegramCursorBridgeLive.js:203:9
 };
 async function handleInboundDecision(decision, ctx, replyToMessageId, resetAgent) {
     const topicId = ctx.state.cursorTopicId;
-    if (topicId === undefined || decision.action === 'ignore') {
+    if (topicId === undefined && decision.action === 'ignore') {
         return ctx.busy;
     }
killedBy: handleInboundDecision returns busy unchanged for ignore or missing topic
statusReason: Expected values to be strictly equal:

1 !== 0

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:203:9
 };
 async function handleInboundDecision(decision, ctx, replyToMessageId, resetAgent) {
     const topicId = ctx.state.cursorTopicId;
-    if (topicId === undefined || decision.action === 'ignore') {
+    if (true) {
         return ctx.busy;
     }
killedBy: handleInboundDecision routes help and status without agent calls
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('help') || p.includes('/help')))

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:207:9
         return ctx.busy;
     }
     const handler = INBOUND_ACTION_HANDLERS[decision.action];
-    if (handler) {
+    if (true) {
         return handler(ctx, topicId, replyToMessageId, resetAgent);
     }
killedBy: runCursorBridgePollOnce processes authorized prompt updates
statusReason: handler is not a function

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:207:18
         return ctx.busy;
     }
     const handler = INBOUND_ACTION_HANDLERS[decision.action];
-    if (handler) {
-        return handler(ctx, topicId, replyToMessageId, resetAgent);
-    }
+    if (handler) {}
     if (decision.action === 'prompt') {
         return handlePromptInboundAction(ctx, topicId, decision.text, replyToMessageId, resetAgent);
killedBy: handleInboundDecision routes help and status without agent calls
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((p) => p.includes('help') || p.includes('/help')))

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:210:9
     if (handler) {
         return handler(ctx, topicId, replyToMessageId, resetAgent);
     }
-    if (decision.action === 'prompt') {
+    if (false) {
         return handlePromptInboundAction(ctx, topicId, decision.text, replyToMessageId, resetAgent);
     }
killedBy: runCursorBridgePollOnce processes authorized prompt updates
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:210:39
     if (handler) {
         return handler(ctx, topicId, replyToMessageId, resetAgent);
     }
-    if (decision.action === 'prompt') {
-        return handlePromptInboundAction(ctx, topicId, decision.text, replyToMessageId, resetAgent);
-    }
+    if (decision.action === 'prompt') {}
     return ctx.busy;
 }
killedBy: runCursorBridgePollOnce processes authorized prompt updates
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:215:53
     }
     return ctx.busy;
 }
-async function handleFailedPoll(deps, pollFailures) {
-    const nextFailures = pollFailures + 1;
-    if (deps.onPollFailure) {
-        await deps.onPollFailure(nextFailures);
-        return;
-    }
-    await sleep((0, telegramCursorBridgeCore_1.decidePollBackoffMs)(nextFailures));
-}
+async function handleFailedPoll(deps, pollFailures) {}
 function makePollHandlerContext(deps, holder) {
     const persistState = () => writeJsonFile(deps.statePath, holder.state);
killedBy: runCursorBridgePollOnce backs off when polling fails
statusReason: Expected values to be strictly equal:

0 !== 1

[Killed] ArithmeticOperator
out/tools/telegramCursorBridgeLive.js:216:26
     return ctx.busy;
 }
 async function handleFailedPoll(deps, pollFailures) {
-    const nextFailures = pollFailures + 1;
+    const nextFailures = pollFailures - 1;
     if (deps.onPollFailure) {
         await deps.onPollFailure(nextFailures);
killedBy: runCursorBridgePollOnce sleeps on poll failure without custom handler
statusReason: The expression evaluated to a falsy value:

  assert.ok(Date.now() - started >= 900)

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:217:29
 }
 async function handleFailedPoll(deps, pollFailures) {
     const nextFailures = pollFailures + 1;
-    if (deps.onPollFailure) {
-        await deps.onPollFailure(nextFailures);
-        return;
-    }
+    if (deps.onPollFailure) {}
     await sleep((0, telegramCursorBridgeCore_1.decidePollBackoffMs)(nextFailures));
 }
killedBy: runCursorBridgePollOnce backs off when polling fails
statusReason: Expected values to be strictly equal:

0 !== 1

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:217:9
 }
 async function handleFailedPoll(deps, pollFailures) {
     const nextFailures = pollFailures + 1;
-    if (deps.onPollFailure) {
+    if (false) {
         await deps.onPollFailure(nextFailures);
         return;
killedBy: runCursorBridgePollOnce backs off when polling fails
statusReason: Expected values to be strictly equal:

0 !== 1

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:223:47
     }
     await sleep((0, telegramCursorBridgeCore_1.decidePollBackoffMs)(nextFailures));
 }
-function makePollHandlerContext(deps, holder) {
-    const persistState = () => writeJsonFile(deps.statePath, holder.state);
-    const syncAgentIdFromSession = () => {
-        holder.state = { ...holder.state, agentId: deps.agentSession.readAgentId() };
-    };
-    const resetAgent = async () => {
-        await deps.agentSession.resetSession();
-        syncAgentIdFromSession();
-        persistState();
-    };
-    const post = deps.post ?? ((token, chatId, topicId, text, replyToMessageId) => postChunks(token, chatId, topicId, text, replyToMessageId));
-    return { persistState, syncAgentIdFromSession, resetAgent, post };
-}
+function makePollHandlerContext(deps, holder) {}
 async function processInboundUpdates(deps, updates, holder, handlerCtx) {
     for (const update of updates) {
killedBy: runCursorBridgePollOnce processes authorized prompt updates
statusReason: Cannot read properties of undefined (reading 'post')

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:224:26
     await sleep((0, telegramCursorBridgeCore_1.decidePollBackoffMs)(nextFailures));
 }
 function makePollHandlerContext(deps, holder) {
-    const persistState = () => writeJsonFile(deps.statePath, holder.state);
+    const persistState = () => undefined;
     const syncAgentIdFromSession = () => {
         holder.state = { ...holder.state, agentId: deps.agentSession.readAgentId() };
killedBy: runCursorBridgePollOnce persists reset state via persistState
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'old-agent'
- 'mock-agent-1785199289476'

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:225:42
 }
 function makePollHandlerContext(deps, holder) {
     const persistState = () => writeJsonFile(deps.statePath, holder.state);
-    const syncAgentIdFromSession = () => {
-        holder.state = { ...holder.state, agentId: deps.agentSession.readAgentId() };
-    };
+    const syncAgentIdFromSession = () => {};
     const resetAgent = async () => {
         await deps.agentSession.resetSession();
killedBy: runCursorBridgePollOnce persists reset state via persistState
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'old-agent'
- 'mock-agent-1785199289473'

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:228:36
     const syncAgentIdFromSession = () => {
         holder.state = { ...holder.state, agentId: deps.agentSession.readAgentId() };
     };
-    const resetAgent = async () => {
-        await deps.agentSession.resetSession();
-        syncAgentIdFromSession();
-        persistState();
-    };
+    const resetAgent = async () => {};
     const post = deps.post ?? ((token, chatId, topicId, text, replyToMessageId) => postChunks(token, chatId, topicId, text, replyToMessageId));
     return { persistState, syncAgentIdFromSession, resetAgent, post };
killedBy: runCursorBridgePollOnce persists agent id after reset via new-session
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'old-agent'
- 'mock-agent-1'

[Killed] LogicalOperator
out/tools/telegramCursorBridgeLive.js:233:18
         syncAgentIdFromSession();
         persistState();
     };
-    const post = deps.post ?? ((token, chatId, topicId, text, replyToMessageId) => postChunks(token, chatId, topicId, text, replyToMessageId));
+    const post = deps.post && ((token, chatId, topicId, text, replyToMessageId) => postChunks(token, chatId, topicId, text, replyToMessageId));
     return { persistState, syncAgentIdFromSession, resetAgent, post };
 }
killedBy: runCursorBridgePollOnce processes authorized prompt updates
statusReason: Telegram API responded with status 404: Not Found

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:233:32
         syncAgentIdFromSession();
         persistState();
     };
-    const post = deps.post ?? ((token, chatId, topicId, text, replyToMessageId) => postChunks(token, chatId, topicId, text, replyToMessageId));
+    const post = deps.post ?? (() => undefined);
     return { persistState, syncAgentIdFromSession, resetAgent, post };
 }
killedBy: runCursorBridgePollOnce uses default postChunks when post override is omitted
statusReason: The expression evaluated to a falsy value:

  assert.ok(sent.some((call) => call.chunk.includes('Cursor bridge status')))

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:236:73
     const post = deps.post ?? ((token, chatId, topicId, text, replyToMessageId) => postChunks(token, chatId, topicId, text, replyToMessageId));
     return { persistState, syncAgentIdFromSession, resetAgent, post };
 }
-async function processInboundUpdates(deps, updates, holder, handlerCtx) {
-    for (const update of updates) {
-        const inbound = inboundEventOf(update);
-        if (!inbound) {
-            continue;
-        }
-        const rawDecision = (0, telegramCursorBridgeCore_1.decideInboundAction)(inbound, deps.principalUserId, deps.chatId, holder.state.cursorTopicId);
-        const decision = (0, telegramCursorBridgeCore_1.gateBusy)(rawDecision, holder.busy);
-        if (decision.action === 'prompt') {
-            holder.busy = true;
-        }
-        holder.busy = await handleInboundDecision(decision, {
-            botToken: deps.botToken,
-            chatId: deps.chatId,
-            state: holder.state,
-            busy: holder.busy,
-            agentSession: deps.agentSession,
-            opDir: deps.opDir,
-            post: handlerCtx.post,
-            persistState: handlerCtx.persistState,
-            syncAgentIdFromSession: handlerCtx.syncAgentIdFromSession,
-        }, update.message?.message_id, handlerCtx.resetAgent);
-    }
-}
+async function processInboundUpdates(deps, updates, holder, handlerCtx) {}
 async function runCursorBridgePollOnce(deps, state, busy, pollFailures) {
     const getUpdates = deps.getUpdates ?? telegramClient_1.getTelegramUpdates;
killedBy: runCursorBridgePollOnce skips updates without inbound events
statusReason: Expected values to be strictly equal:

0 !== 1

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:237:35
     return { persistState, syncAgentIdFromSession, resetAgent, post };
 }
 async function processInboundUpdates(deps, updates, holder, handlerCtx) {
-    for (const update of updates) {
-        const inbound = inboundEventOf(update);
-        if (!inbound) {
-            continue;
-        }
-        const rawDecision = (0, telegramCursorBridgeCore_1.decideInboundAction)(inbound, deps.principalUserId, deps.chatId, holder.state.cursorTopicId);
-        const decision = (0, telegramCursorBridgeCore_1.gateBusy)(rawDecision, holder.busy);
-        if (decision.action === 'prompt') {
-            holder.busy = true;
-        }
-        holder.busy = await handleInboundDecision(decision, {
-            botToken: deps.botToken,
-            chatId: deps.chatId,
-            state: holder.state,
-            busy: holder.busy,
-            agentSession: deps.agentSession,
-            opDir: deps.opDir,
-            post: handlerCtx.post,
-            persistState: handlerCtx.persistState,
-            syncAgentIdFromSession: handlerCtx.syncAgentIdFromSession,
-        }, update.message?.message_id, handlerCtx.resetAgent);
-    }
+    for (const update of updates) {}
 }
 async function runCursorBridgePollOnce(deps, state, busy, pollFailures) {
killedBy: runCursorBridgePollOnce skips updates without inbound events
statusReason: Expected values to be strictly equal:

0 !== 1

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:239:23
 async function processInboundUpdates(deps, updates, holder, handlerCtx) {
     for (const update of updates) {
         const inbound = inboundEventOf(update);
-        if (!inbound) {
-            continue;
-        }
+        if (!inbound) {}
         const rawDecision = (0, telegramCursorBridgeCore_1.decideInboundAction)(inbound, deps.principalUserId, deps.chatId, holder.state.cursorTopicId);
         const decision = (0, telegramCursorBridgeCore_1.gateBusy)(rawDecision, holder.busy);
killedBy: runCursorBridgePollOnce skips updates without inbound events
statusReason: Cannot read properties of undefined (reading 'chatId')

[Killed] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:239:13
 async function processInboundUpdates(deps, updates, holder, handlerCtx) {
     for (const update of updates) {
         const inbound = inboundEventOf(update);
-        if (!inbound) {
+        if (inbound) {
             continue;
         }
killedBy: runCursorBridgePollOnce skips updates without inbound events
statusReason: Cannot read properties of undefined (reading 'chatId')

[Killed] EqualityOperator
out/tools/telegramCursorBridgeLive.js:244:13
         }
         const rawDecision = (0, telegramCursorBridgeCore_1.decideInboundAction)(inbound, deps.principalUserId, deps.chatId, holder.state.cursorTopicId);
         const decision = (0, telegramCursorBridgeCore_1.gateBusy)(rawDecision, holder.busy);
-        if (decision.action === 'prompt') {
+        if (decision.action !== 'prompt') {
             holder.busy = true;
         }
killedBy: runCursorBridgePollOnce clears busy after help command
statusReason: Expected values to be strictly equal:

true !== false

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:244:13
         }
         const rawDecision = (0, telegramCursorBridgeCore_1.decideInboundAction)(inbound, deps.principalUserId, deps.chatId, holder.state.cursorTopicId);
         const decision = (0, telegramCursorBridgeCore_1.gateBusy)(rawDecision, holder.busy);
-        if (decision.action === 'prompt') {
+        if (true) {
             holder.busy = true;
         }
killedBy: runCursorBridgePollOnce clears busy after help command
statusReason: Expected values to be strictly equal:

true !== false

[Survived] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:245:27
         const rawDecision = (0, telegramCursorBridgeCore_1.decideInboundAction)(inbound, deps.principalUserId, deps.chatId, holder.state.cursorTopicId);
         const decision = (0, telegramCursorBridgeCore_1.gateBusy)(rawDecision, holder.busy);
         if (decision.action === 'prompt') {
-            holder.busy = true;
+            holder.busy = false;
         }
         holder.busy = await handleInboundDecision(decision, {

[Survived] OptionalChaining
out/tools/telegramCursorBridgeLive.js:257:12
             post: handlerCtx.post,
             persistState: handlerCtx.persistState,
             syncAgentIdFromSession: handlerCtx.syncAgentIdFromSession,
-        }, update.message?.message_id, handlerCtx.resetAgent);
+        }, update.message.message_id, handlerCtx.resetAgent);
     }
 }
