[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:260:73
         }, update.message?.message_id, handlerCtx.resetAgent);
     }
 }
-async function runCursorBridgePollOnce(deps, state, busy, pollFailures) {
-    const getUpdates = deps.getUpdates ?? telegramClient_1.getTelegramUpdates;
-    const timeout = deps.pollTimeoutSeconds ?? exports.POLL_TIMEOUT_SECONDS;
-    const poll = await getUpdates(deps.botToken, state.updateOffset, timeout);
-    if (!poll.success) {
-        await handleFailedPoll(deps, pollFailures);
-        return { state, busy, pollFailures: pollFailures + 1 };
-    }
-    const holder = {
-        state: { ...state, updateOffset: (0, telegramTopicDecisions_1.nextUpdateOffset)(poll.updates, state.updateOffset) },
-        busy,
-    };
-    writeJsonFile(deps.statePath, holder.state);
-    writePollHeartbeat(deps.opDir);
-    await processInboundUpdates(deps, poll.updates, holder, makePollHandlerContext(deps, holder));
-    return { state: holder.state, busy: holder.busy, pollFailures: 0 };
-}
+async function runCursorBridgePollOnce(deps, state, busy, pollFailures) {}
 async function runCursorBridgeBootIfConfigured(env, ctx) {
     if (!env.bootPrompt || ctx.state.cursorTopicId === undefined) {
killedBy: runCursorBridgePollOnce processes authorized prompt updates
statusReason: Cannot read properties of undefined (reading 'pollFailures')

[Killed] LogicalOperator
out/tools/telegramCursorBridgeLive.js:261:24
     }
 }
 async function runCursorBridgePollOnce(deps, state, busy, pollFailures) {
-    const getUpdates = deps.getUpdates ?? telegramClient_1.getTelegramUpdates;
+    const getUpdates = deps.getUpdates && telegramClient_1.getTelegramUpdates;
     const timeout = deps.pollTimeoutSeconds ?? exports.POLL_TIMEOUT_SECONDS;
     const poll = await getUpdates(deps.botToken, state.updateOffset, timeout);
killedBy: runCursorBridgePollOnce processes authorized prompt updates
statusReason: Expected values to be strictly equal:

1 !== 0

[Killed] LogicalOperator
out/tools/telegramCursorBridgeLive.js:262:21
 }
 async function runCursorBridgePollOnce(deps, state, busy, pollFailures) {
     const getUpdates = deps.getUpdates ?? telegramClient_1.getTelegramUpdates;
-    const timeout = deps.pollTimeoutSeconds ?? exports.POLL_TIMEOUT_SECONDS;
+    const timeout = deps.pollTimeoutSeconds && exports.POLL_TIMEOUT_SECONDS;
     const poll = await getUpdates(deps.botToken, state.updateOffset, timeout);
     if (!poll.success) {
killedBy: runCursorBridgePollOnce forwards custom poll timeout to getUpdates
statusReason: Expected values to be strictly equal:

30 !== 7

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:264:24
     const getUpdates = deps.getUpdates ?? telegramClient_1.getTelegramUpdates;
     const timeout = deps.pollTimeoutSeconds ?? exports.POLL_TIMEOUT_SECONDS;
     const poll = await getUpdates(deps.botToken, state.updateOffset, timeout);
-    if (!poll.success) {
-        await handleFailedPoll(deps, pollFailures);
-        return { state, busy, pollFailures: pollFailures + 1 };
-    }
+    if (!poll.success) {}
     const holder = {
         state: { ...state, updateOffset: (0, telegramTopicDecisions_1.nextUpdateOffset)(poll.updates, state.updateOffset) },
killedBy: runCursorBridgePollOnce backs off when polling fails
statusReason: Cannot read properties of undefined (reading 'reduce')

[Killed] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:264:9
     const getUpdates = deps.getUpdates ?? telegramClient_1.getTelegramUpdates;
     const timeout = deps.pollTimeoutSeconds ?? exports.POLL_TIMEOUT_SECONDS;
     const poll = await getUpdates(deps.botToken, state.updateOffset, timeout);
-    if (!poll.success) {
+    if (poll.success) {
         await handleFailedPoll(deps, pollFailures);
         return { state, busy, pollFailures: pollFailures + 1 };
killedBy: runCursorBridgePollOnce processes authorized prompt updates
statusReason: Expected values to be strictly equal:

1 !== 0

[Killed] ArithmeticOperator
out/tools/telegramCursorBridgeLive.js:266:45
     const poll = await getUpdates(deps.botToken, state.updateOffset, timeout);
     if (!poll.success) {
         await handleFailedPoll(deps, pollFailures);
-        return { state, busy, pollFailures: pollFailures + 1 };
+        return { state, busy, pollFailures: pollFailures - 1 };
     }
     const holder = {
killedBy: runCursorBridgePollOnce backs off when polling fails
statusReason: Expected values to be strictly equal:

-1 !== 1

[Killed] ObjectLiteral
out/tools/telegramCursorBridgeLive.js:266:16
     const poll = await getUpdates(deps.botToken, state.updateOffset, timeout);
     if (!poll.success) {
         await handleFailedPoll(deps, pollFailures);
-        return { state, busy, pollFailures: pollFailures + 1 };
+        return {};
     }
     const holder = {
killedBy: runCursorBridgePollOnce backs off when polling fails
statusReason: Expected values to be strictly equal:

undefined !== 1

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:277:58
     await processInboundUpdates(deps, poll.updates, holder, makePollHandlerContext(deps, holder));
     return { state: holder.state, busy: holder.busy, pollFailures: 0 };
 }
-async function runCursorBridgeBootIfConfigured(env, ctx) {
-    if (!env.bootPrompt || ctx.state.cursorTopicId === undefined) {
-        return ctx.busy;
-    }
-    const post = env.post ?? postChunks;
-    await post(env.botToken, env.chatId, ctx.state.cursorTopicId, `Boot test prompt: ${env.bootPrompt}`);
-    return handleInboundDecision({ action: 'prompt', text: env.bootPrompt }, {
-        botToken: env.botToken,
-        chatId: env.chatId,
-        state: ctx.state,
-        busy: ctx.busy,
-        agentSession: ctx.agentSession,
-        opDir: ctx.opDir,
-        post,
-        persistState: ctx.persistState,
-        syncAgentIdFromSession: ctx.syncAgentIdFromSession,
-    }, undefined, ctx.resetAgent);
-}
+async function runCursorBridgeBootIfConfigured(env, ctx) {}
 async function runCursorBridgeLoop(loopDeps, initial, shouldContinue) {
     let state = initial.state;
killedBy: runCursorBridgeBootIfConfigured is a no-op without boot prompt
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- false

[Killed] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:278:9
     return { state: holder.state, busy: holder.busy, pollFailures: 0 };
 }
 async function runCursorBridgeBootIfConfigured(env, ctx) {
-    if (!env.bootPrompt || ctx.state.cursorTopicId === undefined) {
+    if (env.bootPrompt || ctx.state.cursorTopicId === undefined) {
         return ctx.busy;
     }
killedBy: runCursorBridgeBootIfConfigured is a no-op without boot prompt
statusReason: Telegram API responded with status 404: Not Found

[Killed] EqualityOperator
out/tools/telegramCursorBridgeLive.js:278:28
     return { state: holder.state, busy: holder.busy, pollFailures: 0 };
 }
 async function runCursorBridgeBootIfConfigured(env, ctx) {
-    if (!env.bootPrompt || ctx.state.cursorTopicId === undefined) {
+    if (!env.bootPrompt || ctx.state.cursorTopicId !== undefined) {
         return ctx.busy;
     }
killedBy: runCursorBridgeBootIfConfigured runs boot prompt when configured
statusReason: The expression evaluated to a falsy value:

  assert.ok(posts.some((text) => text.includes('Boot test prompt: wake')))

[Killed] LogicalOperator
out/tools/telegramCursorBridgeLive.js:281:18
     if (!env.bootPrompt || ctx.state.cursorTopicId === undefined) {
         return ctx.busy;
     }
-    const post = env.post ?? postChunks;
+    const post = env.post && postChunks;
     await post(env.botToken, env.chatId, ctx.state.cursorTopicId, `Boot test prompt: ${env.bootPrompt}`);
     return handleInboundDecision({ action: 'prompt', text: env.bootPrompt }, {
killedBy: runCursorBridgeApp runs boot prompt and a single poll when configured
statusReason: Telegram API responded with status 404: Not Found

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:295:71
         syncAgentIdFromSession: ctx.syncAgentIdFromSession,
     }, undefined, ctx.resetAgent);
 }
-async function runCursorBridgeLoop(loopDeps, initial, shouldContinue) {
-    let state = initial.state;
-    let busy = initial.busy;
-    let pollFailures = initial.pollFailures;
-    while (shouldContinue()) {
-        const next = await runCursorBridgePollOnce(loopDeps, state, busy, pollFailures);
-        state = next.state;
-        busy = next.busy;
-        pollFailures = next.pollFailures;
-    }
-    return { state, busy, pollFailures };
-}
+async function runCursorBridgeLoop(loopDeps, initial, shouldContinue) {}
 async function runCursorBridgeApp(env, agentSession) {
     const opDir = path.join(env.repoRoot, '.swarmforge', 'operator');
killedBy: runCursorBridgeLoop stops when shouldContinue returns false
statusReason: Expected values to be strictly equal:

0 !== 2

[Killed] ConditionalExpression
out/tools/telegramCursorBridgeLive.js:299:12
     let state = initial.state;
     let busy = initial.busy;
     let pollFailures = initial.pollFailures;
-    while (shouldContinue()) {
+    while (false) {
         const next = await runCursorBridgePollOnce(loopDeps, state, busy, pollFailures);
         state = next.state;
killedBy: runCursorBridgeLoop stops when shouldContinue returns false
statusReason: Expected values to be strictly equal:

0 !== 2

[Timeout] BlockStatement
out/tools/telegramCursorBridgeLive.js:299:30
     let state = initial.state;
     let busy = initial.busy;
     let pollFailures = initial.pollFailures;
-    while (shouldContinue()) {
-        const next = await runCursorBridgePollOnce(loopDeps, state, busy, pollFailures);
-        state = next.state;
-        busy = next.busy;
-        pollFailures = next.pollFailures;
-    }
+    while (shouldContinue()) {}
     return { state, busy, pollFailures };
 }

[Killed] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:312:16
     const statePath = path.join(opDir, exports.STATE_FILE_NAME);
     const topicMapPath = path.join(opDir, exports.TOPIC_MAP_FILE_NAME);
     let state = await bootstrapCursorBridgeState(env.repoRoot, env.botToken, env.chatId, statePath, topicMapPath);
-    let busy = false;
+    let busy = true;
     let pollFailures = 0;
     const persistState = () => writeJsonFile(statePath, state);
killedBy: runCursorBridgeApp starts idle so the first poll can accept prompts
statusReason: Expected values to be strictly equal:

false !== true

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:314:26
     let state = await bootstrapCursorBridgeState(env.repoRoot, env.botToken, env.chatId, statePath, topicMapPath);
     let busy = false;
     let pollFailures = 0;
-    const persistState = () => writeJsonFile(statePath, state);
+    const persistState = () => undefined;
     const syncAgentIdFromSession = () => {
         state = { ...state, agentId: agentSession.readAgentId() };
killedBy: runCursorBridgeApp boot persists state after active-run recovery reset
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'stale-agent'
- 'mock-agent-1785199292187'

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:315:42
     let busy = false;
     let pollFailures = 0;
     const persistState = () => writeJsonFile(statePath, state);
-    const syncAgentIdFromSession = () => {
-        state = { ...state, agentId: agentSession.readAgentId() };
-    };
+    const syncAgentIdFromSession = () => {};
     const resetAgent = async () => {
         await agentSession.resetSession();
killedBy: runCursorBridgeApp boot persists state after active-run recovery reset
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'stale-agent'
- 'mock-agent-1785199292197'

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:318:36
     const syncAgentIdFromSession = () => {
         state = { ...state, agentId: agentSession.readAgentId() };
     };
-    const resetAgent = async () => {
-        await agentSession.resetSession();
-        syncAgentIdFromSession();
-        persistState();
-    };
+    const resetAgent = async () => {};
     busy = await runCursorBridgeBootIfConfigured(env, {
         state,
killedBy: runCursorBridgeApp boot persists state after active-run recovery reset
statusReason: The expression evaluated to a falsy value:

  assert.ok(resetCalls >= 1)

[Killed] ObjectLiteral
out/tools/telegramCursorBridgeLive.js:323:55
         syncAgentIdFromSession();
         persistState();
     };
-    busy = await runCursorBridgeBootIfConfigured(env, {
-        state,
-        busy,
-        agentSession,
-        opDir,
-        persistState,
-        syncAgentIdFromSession,
-        resetAgent,
-    });
+    busy = await runCursorBridgeBootIfConfigured(env, {});
     const loopDeps = {
         botToken: env.botToken,
killedBy: runCursorBridgeApp runs boot prompt and a single poll when configured
statusReason: Cannot read properties of undefined (reading 'cursorTopicId')

[Killed] ObjectLiteral
out/tools/telegramCursorBridgeLive.js:332:22
         syncAgentIdFromSession,
         resetAgent,
     });
-    const loopDeps = {
-        botToken: env.botToken,
-        chatId: env.chatId,
-        principalUserId: env.principalUserId,
-        opDir,
-        statePath,
-        topicMapPath,
-        agentSession,
-        ...env.loopOverrides,
-    };
+    const loopDeps = {};
     const loopResult = await runCursorBridgeLoop(loopDeps, { state, busy, pollFailures }, env.shouldContinue ?? (() => true));
     state = loopResult.state;
killedBy: runCursorBridgeApp runs boot prompt and a single poll when configured
statusReason: Test timed out in 20000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
out/tools/telegramCursorBridgeLive.js:342:114
         agentSession,
         ...env.loopOverrides,
     };
-    const loopResult = await runCursorBridgeLoop(loopDeps, { state, busy, pollFailures }, env.shouldContinue ?? (() => true));
+    const loopResult = await runCursorBridgeLoop(loopDeps, { state, busy, pollFailures }, env.shouldContinue ?? (() => undefined));
     state = loopResult.state;
     busy = loopResult.busy;
killedBy: runCursorBridgeApp default shouldContinue falls back to endless polling hook
statusReason: Missing expected rejection.

[Killed] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:342:120
         agentSession,
         ...env.loopOverrides,
     };
-    const loopResult = await runCursorBridgeLoop(loopDeps, { state, busy, pollFailures }, env.shouldContinue ?? (() => true));
+    const loopResult = await runCursorBridgeLoop(loopDeps, { state, busy, pollFailures }, env.shouldContinue ?? (() => false));
     state = loopResult.state;
     busy = loopResult.busy;
killedBy: runCursorBridgeApp default shouldContinue falls back to endless polling hook
statusReason: Missing expected rejection.

[Killed] BlockStatement
out/tools/telegramCursorBridgeLive.js:347:96
     busy = loopResult.busy;
     pollFailures = loopResult.pollFailures;
 }
-async function bootstrapCursorBridgeState(repoRoot, botToken, chatId, statePath, topicMapPath) {
-    const opDir = path.join(repoRoot, '.swarmforge', 'operator');
-    fs.mkdirSync(opDir, { recursive: true });
-    let state = (0, telegramCursorBridgeCore_1.parseCursorBridgeState)(loadJsonFile(statePath));
-    state = await ensureCursorTopic(botToken, chatId, topicMapPath, state);
-    writeJsonFile(statePath, state);
-    return state;
-}
+async function bootstrapCursorBridgeState(repoRoot, botToken, chatId, statePath, topicMapPath) {}
 //# sourceMappingURL=telegramCursorBridgeLive.js.map
killedBy: bootstrapCursorBridgeState persists topic id
statusReason: Cannot read properties of undefined (reading 'cursorTopicId')

[Killed] BooleanLiteral
out/tools/telegramCursorBridgeLive.js:349:38
 }
 async function bootstrapCursorBridgeState(repoRoot, botToken, chatId, statePath, topicMapPath) {
     const opDir = path.join(repoRoot, '.swarmforge', 'operator');
-    fs.mkdirSync(opDir, { recursive: true });
+    fs.mkdirSync(opDir, { recursive: false });
     let state = (0, telegramCursorBridgeCore_1.parseCursorBridgeState)(loadJsonFile(statePath));
     state = await ensureCursorTopic(botToken, chatId, topicMapPath, state);
killedBy: bootstrapCursorBridgeState persists topic id
statusReason: EEXIST: file already exists, mkdir '/tmp/sfvc-tg-bridge-live-x3mYpu/.swarmforge/operator'
